hathach/tinyusb/hw/bsp/at32f415/boards/AT_START_F415/AT32F415xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>Comparator</description>
      <groupName>CMP</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3FF</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMP1</name>
        <description>CMP1 interrupt</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>CMP2</name>
        <description>CMP2 interrupt</description>
        <value>71</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLSTS1</name>
          <displayName>CTRLSTS1</displayName>
          <description>CMP control/status register1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP1EN</name>
              <description>Comparator1 enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1IS</name>
              <description>Comparator1 input shift</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1SSEL</name>
              <description>Comparator1 speed selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1INVSEL</name>
              <description>Comparator1 inverting selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1TAG</name>
              <description>Comparator1 output target</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1P</name>
              <description>Comparator1 polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1HYST</name>
              <description>Comparator1 hysteresis</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP1VALUE</name>
              <description>Comparator1 output value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>CMP1WP</name>
              <description>Comparator1 write protect</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2EN</name>
              <description>Comparator2 enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2SSEL</name>
              <description>Comparator2 speed selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2INVSEL</name>
              <description>Comparator2 inverting selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>DCMPEN</name>
              <description>Double comparator mode enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2TAG</name>
              <description>Comparator2 output target</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2P</name>
              <description>Comparator2 polarity</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2HYST</name>
              <description>Comparator2 hysteresis</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMP2VALUE</name>
              <description>Comparator2 output value</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>CMP2WP</name>
              <description>Comparator2 write protect</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLSTS2</name>
          <displayName>CTRLSTS2</displayName>
          <description>CMP control/status register2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>COMP1NINVSEL</name>
              <description>Comparator1 non-inverting input selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>COMP2NINVSEL</name>
              <description>Comparator2 non-inverting input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
